allProjects = [{"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/17732807?v=4", "user": "z3bg", "name": "José Barata Gonçalves"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/24463020?v=4", "user": "diogofgr", "name": "Diogo Farias Rodrigues"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/28633879?v=3", "user": "guilhermesoeiro", "name": "Guilherme Soeiro"}], "image": "https://i.imgur.com/ajgWFey.jpg", "repo": "https://github.com/diogofgr/play-up", "owner": "z3bg", "intro": "PlayUp, it´s a Social Gaming Network where people can challenge others in a real-life game\n\n#Challenges, #Social, #Gaming, #RealLife\n\nChallenge Everything ", "video": "", "active": true, "id": 26, "description": "# PlayUp\n\n### Wanna *grow* and develop your *skills* in a **funny** and **cool** way?\n### Wanna do that with your *friends* and see who's doing better?\n\nPlayUp, try to address that and much more.\n\nSimple you add your friends to the platform, chat with them to see for example where they are and anytime you can challenge them to do something and see if they can do it!\n\n\n### Compete/Cooperate in teams and get *prizes* (EXP, badges and more) according to your level\n\nChallenges Like:\n- [ ] See who do more push-ups in 1min\n- [ ] Iron Fist\n- [ ] FreeeDom Jump\n- [ ] Hack the System (whatever this might be x)\n- [ ] RobinHood Style\n- [ ] Sing loud Tony Carrera \"original\" Song\n\n... BCreative\n\n## That's what it´s all about!\n\nhttp://play-up.herokuapp.com/\n\n\n", "name": "PlayUp", "created_at": "2017-09-29 14:07:18.001000", "wallet": "82f47ce5a542fff0fdbe8068e953d7146f2d202f"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/10999068?v=4", "user": "diogodebastos", "name": "Diogo de Bastos"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/2984831?v=4", "user": "ggraca", "name": "Guilherme Graça"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/3541185?v=3", "user": "ricardopereira", "name": "Ricardo Pereira"}], "image": "https://i.imgur.com/cLE8zbj.png", "repo": "https://github.com/GGraca/pixels-sims", "owner": "diogodebastos", "intro": "pixels.camp simulated ", "video": "", "active": true, "id": 30, "description": "We wanted to know who was going to win this year's pixels.camp edition beforehand. So you entered the rules and created every participant profile (developers, designers and business) making them a player with different skills and level of skills, such as: coding, creativity and charm. Hunger, entertainment and EXP also have a role in the game and in the end we'll see who wins!", "name": "pixels.sims", "created_at": "2017-09-29 14:33:14.976000", "wallet": "cab98ec88638bf8559b819ab7c6b48a6655f66a6"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/3475499?v=3", "user": "ivonunes", "name": "Ivo Nunes"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/22499633?v=3", "user": "slanca", "name": "Sérgio"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/10215472?v=4", "user": "kamaradas", "name": "Samuel Rodrigues"}], "image": "https://i.imgur.com/nyYkdYZ.png", "repo": "", "owner": "ivonunes", "intro": "An easier way to organise nights out.", "video": "", "active": true, "id": 3, "description": "We've all been there. You feel like going out with your friends, but organising a night out takes far too long.\n\nThis is why we've created Nightowl. You just pick a date and send a unique link to each of your friends.\n\nWe grab the latest events running on that date and ask for each of you to pick your preferences. Then, using everyone's answers, we pick a suggestion that is sure to appease everyone, followed by the final results of who's going and who's not.\n\nSimple, right?\n\n**URL:** [https://nightowl.fun](https://nightowl.fun)", "name": "Nightowl", "created_at": "2017-09-28 11:17:00.498000", "wallet": "0f9f16eae3d3816c5cca876248842b75a3641795"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/7089?v=3", "user": "alcides", "name": "Alcides Fonseca"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/2805206?v=3", "user": "henriquemacedo", "name": "Henrique Macedo"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/595938?v=3", "user": "rchicoria", "name": "Rui Chicória"}], "image": "https://i.imgur.com/WVd0zFe.jpg", "repo": "", "owner": "alcides", "intro": "Tired of looking into the nutricional values of every product on the supermarket alley? Get relevant information at a glance, through an AR-augmented birds eye view of any shelf.", "video": "", "active": true, "id": 34, "description": "### helpAR\n\nOur goal is to **improve the shopping experience** by applying AR and Machine Learning models. \n\nPoint your phone at the shelf, and get **personalized relevant information about the product**. Do you care about your sugar intake? Show sugar cubes on top. Do you care about salt? Same. We also have a color-coding system to make it simples to filter good choices from bad.\n\nhelpAR puts important information (usually burried in fine print on the back of each package) right on top of products, where they can be used to make your shopping experience faster and better.\n\nhelpAR can also be tailored to high-end products. Choosing wines is a professional's task. But with helpAR, you can see the ratings right in front of you, and you can open more information directly on the app. Maybe you need expert reviews... Well, they are just one click away.\n\nPicking wine is an easy task? Maybe you also need help with books, smartphones, TVs or any other product where profissional and crowdsourced reviews are useful in your decision process.\n\n\n### How does it work\n\n1 You open the app, and point the camera at the shelf.\n\n![](https://i.imgur.com/kaC99kS.png)\n\n2 The app automatically identifies the products and shows you *one relevant feature*, which can be customized according to product type and your user profile (sugar, fat, rating).\n\n![](https://i.imgur.com/tgMwgov.png)\n\n3 You can select which product you want to buy. In case of doubt, you can click the product and a popup will open with more detailed information like specs and product reviews.\n\n![](https://i.imgur.com/vRpo2Ti.png)\n\n### No, really... How does it work\n\nOur prototype is an iOS app, develop using react-native.\n\nWe use CoreML together with Vision to capture the camera pixel buffer, and automatically classify the image into one of X labels. X is the number of products supported (ImageNet is an example of how well this can scale to thousands of labels).\n\nThe classification uses a CoreML model that was generated from a caffe neural network that we trained with some product examples. Details can be made available suject to how much was investiment in this project.\n\nProduct information was scrapped from several sources, using the Scrappy Python API.\n\n\n### The Team\n\nOur team has experts in different areas:\n\nRui Chicória - Backend Development, Beer  geek   \nAlcides Fonseca - Machine Learning, Water boy   \nHenrique Macedo - Front-end Design, Wine lover ", "name": "helpAR", "created_at": "2017-09-29 16:43:24.004000", "wallet": "ec773cf6b4eb66e89531131043b79bfe96d6ceee"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/191885?v=3", "user": "luisfcorreia", "name": "Luis Correia"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/664904?v=3", "user": "jpralves", "name": "João Alves"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/543344?v=3", "user": "brunoamaral", "name": "Bruno Amaral"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/168636?v=3", "user": "smpb", "name": "Sérgio Bernardino"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/168632?v=3", "user": "madril", "name": "Miguel Nogueira"}], "image": "https://i.imgur.com/klNHokX.jpg", "repo": "", "owner": "luisfcorreia", "intro": "Converting digital currency into arcade credits", "video": "", "active": true, "id": 27, "description": "By accepting the challenge to use EXPOSURE as currency, we've converted our arcade into receiving EXP and using them as credits.\n\nWe're using cloud technology and IoT to provide a simple and manageable solution to interface physical monetary systems with digital currency.\n\nWith more time, this technology could also be expanded to vending machines of all types, including client validation.\n\nYou can transfer EXP to this address and then PLAY\nhttps://wallet.pixels.camp/?to=0x9d7054266ec821d0f2fb583272b5a781bb4f7928#send-transaction", "name": "If Pay Then Play", "created_at": "2017-09-29 14:13:12.813000", "wallet": "57ac502f3dbea7519c6890a04c53f34d3022c4b4"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/12183296?v=4", "user": "pedrombrosa", "name": "Pedro Rosa"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/21102237?v=4", "user": "idealmente", "name": "Pedro Teixeira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/9153126?v=4", "user": "brunohorta82", "name": "Bruno Horta"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/12182343?v=4", "user": "nloom", "name": "Nuno Santos"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/1061523?v=4", "user": "ricardooliveira", "name": "Ricardo Oliveira"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/10140448?v=4", "user": "rafaelevaristo", "name": "Rafael Evaristo"}], "image": "https://i.imgur.com/qjFVbx9.png", "repo": "", "owner": "rafaelevaristo", "intro": "Have you ever asked about the noodles corridor in the supermarket? \n\nHave you ever been in a building looking for an exit? Has your younger brother ever lost you in a giant space?\n\nHave you thought about how you are going to find your friends in #Websummit?\n\n# Camp'sLocation is all about that !!!", "video": "", "active": true, "id": 10, "description": "### We add value to the shopping experience by *reducing friction in finding things* on your shopping list.\n\n### Finding shoping items in an indoor can be a headache and we can help  by applying this technology . \n\n### Our tecnology gives you the power to find places, people and things indoor *changing the way the space is perceived*.\n\n### Retailers, logistic operators, build management companies, hospitals, event organizers and marketing companies will benefit from a smart and geolocalized environment .\n\n### We are using Beacon tecnology to create a smart grid that enables to pinpoint any given object or person inside it.\n\n### This is a scalable and easy to install solution giving you the power to make better well informed decisions based on real data.\n\n# *Camp'sLocator* - GPS for indoor locations\n## Project 10", "name": "CampLocation", "created_at": "2017-09-28 17:23:24.313000", "wallet": "6200e01375a890d9f5ea7cdb8eab6675691f0cf7"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/11409902?v=4", "user": "beatrizbeato", "name": "Beatriz Beato"}], "image": "https://i.imgur.com/EA4yLvI.jpg", "repo": "", "owner": "beatrizbeato", "intro": "How often do come to a point where we have an existential crisis, and wonder who we are ? Well, know there will be a little place on the inetrnet, sort of a safe-zone really, where you can look yourself in the eye and have an answer coming from the most qualified person to answer it: yourself.", "video": "", "active": true, "id": 23, "description": "How often do come to a point where we have an existential crisis, and wonder who we are ? Well, know there will be a little place on the inetrnet, sort of a safe-zone really, where you can look yourself in the eye and have an answer coming from the most qualified person to answer it: yourself.", "name": "Who am I ?", "created_at": "2017-09-29 12:12:20.250000", "wallet": "c622e71afc91794e684876151dbdf69cdc345246"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/123991?v=3", "user": "xipasduarte", "name": "Pedro Duarte"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/566280?v=3", "user": "edygar", "name": "Edygar de Lima Oliveira"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/499982?v=3", "user": "s3rgiosan", "name": "Sérgio Santos"}], "image": "https://i.imgur.com/bT8nUeA.jpg", "repo": "https://github.com/xipasduarte/smartfleet-design", "owner": "xipasduarte", "intro": "Control your fleet from one \"small\" car to thousands of trucks. With SmartFleet you get features for corporate and personal use, with enhancements to the driver's relationship with the vehicle, dashboard for remote control, alerts and preemptive action with AI suggestions for optimisations and actions.", "video": "https://www.youtube.com/watch?v=2JThGsumMdg", "active": true, "id": 17, "description": "[![Base](https://img.shields.io/badge/Base-Unlocked-red.svg)]()\n\nSmartFleet is a SaaS and on-premises product to help corporations manage their vehicle fleets from Mercedes. All you need is a vehicle that is integrated with the Mercedes API and you're in business.\n\n## Disclaimer\n\nWe initially had an broader aim, but we realised we are much more interested in the challenges for the corporate sector, and theiir potential, rathaer than the consumer sector. For this reason we shifted some of our goals and achievements and foccus now on designing the business for the coporte world.\n\n## Base project – The Dashboard (10000 EXP)\n \nOur plan started small, and this is its inception.\n\nAs faithful participants of Pixels Camp we were front and centre at the keynote session and were immediately struck by the Mercedes challenge to use their new API. Our first thoughts were simple: \"Let's do a dashboard for that.\".\n\nWe were greatly excited and visited to booth to talk to the Mercedes representatives and get more out of what their new product could do. After a long and interesting conversation our minds started pumping out a lot more words and many of those started to look like ideas, until we had a lot.\n\nThe dashboard is obvious, but we need to have it and start somewhere. The application will have a centralised dashboard were you can access and interact with the available features of the Mercedes API. You will have access to the data in a visual aspect and be able to query it (human style) to gather more insights.\n\nThe dashboard will feature an alert interface with push notifications for noteworthy events happening to the vehicle or that need to happen (e.g. vehicle needs servicing).\n\nDashboard contents:\n- Map with locations\n- Fleet short summary\n- Insights (configurable):\n-- Number of vehicles in need of servicing\n-- Number of vehicles with low fuel, oil or any other metric\n\n### Vehicle vision\n\nThe dashboard will have a view for a specific vehicle where there will be a lot more detailed information for that vehicle and where actions can be taken on that vehicle, such as:\n- Block\n- Lock doors and close windows\n- Restrict driving area\n- Etc. (everything the API can handle)\n\nAlongside these actions you will be able to see the car's **Health Status** in dept.\n\n### Access control and Activity log\n\nControl which of your employees can access the dashboard and the information they see. This allows you to have a layer of privacy and security under your control and customization.\n\nKnow who made what or was involved with the vehicle. Drivers can log works hours and have driving hour reports automatically.\n\n## SmartFleet Design\n\nFind more on the [repository](https://github.com/xipasduarte/smartfleet-design) about what we are planning.\n\n## The Team\n\nWe are a small, but dedicated team of passionate engineers that like to work with data and impact the world with the knowledge we gather. We'll be available for some interesting conversations on this project and other topics, find us around the web just follow the links on the sidebar to our profiles.\n\nThank you for all your support.\nAll the SmartFleet Team\n\n\n## Changelog\n\n- Day 1, 22:27 - Project details with achievements and generic information.\n- Day2, 17:41 - We have hit the first milestone.\n- Day 3, 12:00 - Refocus on the corporate sector, where large fleets of vehicles will be in use and other interesting challenges can arise.", "name": "SmartFleet", "created_at": "2017-09-28 21:27:10.593000", "wallet": "10386625d9c7c82b0ae09f8c8c1a9a1ae4182170"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/31651456?v=4", "user": "alvimd", "name": "Diogo Alvim"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/185598?v=3", "user": "madoke", "name": "David Simão"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/11697952?v=4", "user": "jorgefspereira", "name": "Jorge Pereira"}], "image": "https://i.imgur.com/FqYdbph.jpg", "repo": "", "owner": "alvimd", "intro": "Our project aims at providing a simple and unified experience of public transportation, that is independent of the different service providers and currencies across the globe.\nOur customers buy one ticket from point A to B without having to worry about paying to different transport companies or on the local currency.\n\nThe only thing you need to buy a ticket from point A to B is our token: UMT (Unified Mobility Token)", "video": "", "active": true, "id": 12, "description": "## The App is here!\n\n[Faslane App](https://www.dropbox.com/s/9eyza42sxt7e0fq/app-release.apk?dl=0#)\n\n---\n\nIn every city there are different transport companies, with different interfaces, which create entry barriers by requiring users to buy their proprietary transport passes or installing different apps on their phones.\n\nHave you had to buy several tickets to get where you wanted to go?\nHave you queued for 30 mins to buy a ticket just to see your train leaving without you?\nDo you have more than 3 apps to get your tickets?\n\nWorry no more! Get your ticket from Fastlane!\n\nOur product provides customers with a single interface for their mobility. It gives them the freedom to chose where they want to go, it informs them how to get there and it charges them one single time.\n\nOne ticket to take you anywhere and everywhere.\n\nBy using our crypto token (UMT), you are able to pay in any country, independently from the local currency. You can top up your UMT balance using with cryptocurrency or traditional payment methods.\n\n---\n\n# Technical Overview\n## Currency\nFastlane has its own digital currency “Unified Mobility Token” (UMT), which runs on the ethereum blockchain, to manage transactions between customers and transport service providers. When the user installs the app, a private/public key pair is generated offline and securely stored on the device. With these credentials, the users are then able to sign transactions on the blockchain, and therefore, able to buy and spend UMT. Fastlane does not keep their user’s private keys, which means the users are responsible for keeping them safe.\n\n## Spending\nUsers are able to top up their UMT balance by sending Ether to the wallet’s public address and then converting it to UMT. If they prefer to top up using another currency, we plan to use the Shapeshift to handle conversion between that currency and UMT. In the case of tradicional payment services, we can act as exchange and seamlessly fund the users with UMT.\n\n## Instant Transactions\nTransactions on the blockchain are still not there on what concerns instant payments. While we wait for technologies like lightning network and plasma to make it possible to handle instant transactions on a public blockchain, we plan to use intermediary software between the apps and the public blockchain, so that we are able to provide a faster service.\n\n## Backend\nIntegration with service providers would be handled ad-hoc on a first iteration, and as the platform usage and customer base increases, a public API would be released, so that any transportation service provider is able to integrate their own system with the fastlane platform.\n\n## Using Fastlane Tickets\nDepending on the transport provider infrastructure, users are able to purchase their tickets in advance with UMT, or Pay on the go. For the first method, our strategy is to generate a QR code containing information shared between the transport service provider and the user. Also, a public blockchain record which ties the user to that ticket id would be created. Service providers are responsible for handling validating the tickets, as part of their commute logistics. For the pay as you go method, we plan to expose an NFC interface on our application, which would then integrate with the different provider infrastructures, much in the style of contactless payments.\n", "name": "Fastlane", "created_at": "2017-09-28 18:44:37.233000", "wallet": "c717996c16f8f70c37e3dbcc93eb933836e58770"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/21674677?v=4", "user": "alexdsmartins", "name": "Alexandre Martins"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/958819?v=4", "user": "chrisgrabinski", "name": "Christopher Grabiński"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/21694860?v=4", "user": "nnunobm", "name": "Nuno Martins"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/679335?v=4", "user": "johnsardine", "name": "João Sardinha"}], "image": "https://i.imgur.com/Zn7n152.png", "repo": "", "owner": "alexdsmartins", "intro": "A global open-access history database for correlation research.", "video": "", "active": true, "id": 41, "description": "History research is a complicated process. Cross referencing thousands of documents and trying to understand every viewpoint on a giving subject. Reinterpreting primary sources that each generation of historians enabled to be viewed with bias. The constant struggle to analyse each person as an individual and as a collective mind and body. Wars, diseases, celebrations, rituals, economics, law, science. Events that must be understand in their place and time.\n\nWith Athena, we are trying to facilitate part of these laborious task, providing a academy level open-access database, validated by academia, that help relate individual characters and their family structures to events. Showing these structures in the context of their time, which in most of our recorded history here connected to political moves and social shifts.\n\nWith Athena, we want to provide the history research community a comprehensive tool for factual data storage, review and distribution.", "name": "Athena", "created_at": "2017-09-29 20:50:48.154000", "wallet": "591edd210403e9fa45032518c188e26d043199bf"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/2117730?v=4", "user": "johnny1337", "name": "João Ferreira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/464353?v=4", "user": "luispmiranda", "name": "Luís Miranda"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/147782?v=3", "user": "andrefs", "name": "André Santos"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/3806676?v=3", "user": "ferreiratiago", "name": "Tiago Lopes Ferreira"}], "image": "https://i.imgur.com/3INFCYc.png", "repo": "https://github.com/luispmiranda/boothchain", "owner": "johnny1337", "intro": "A photo-booth with a thermal printer and a blockchain payment system.", "video": "", "active": true, "id": 16, "description": "# The Project\n\nPeople can take a photo or upload one to our website and then pay with Exposure to have it printed in a thermal printer.\n\n# Quick Demo\n\n![demo](https://media.giphy.com/media/xT9IghVebmUDsEfoqc/giphy.gif)\n![demo](https://media.giphy.com/media/xT1R9WU01givw7oIbS/giphy.gif)\n\n\n# System Architecture\n\n![system architecture](https://i.imgur.com/RrKNMum.png)\n\n# The Team\n\nOur team, composed by three developers and a designer, is very skilled and well experienced on winning different types of competitions. Also, one time we ordered a burger at McDonald's that looked EXACTLY like the photos. Without further ado, here's the team:\n\n* André \"BoJack\" Santos - 2nd place on the Codebits VI hackathon\n* Tiago \"Khaleesi\" Ferreira - Winner of the Codebits IV Presentation Karaoke\n* Luís \"Mad Max\" Miranda  - Winner of the Codebits III Guitar Hero competition\n* João \"Pickle Rick\" Ferreira - Winner of the Innovation Award on the Miniclip Game Jam 2015\n\n", "name": "Boothchain", "created_at": "2017-09-28 21:06:14.777000", "wallet": "97da70d831d537e4ff3cedef56f566b8374a22fd"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/16867044?v=4", "user": "fpimenta", "name": "Francisco Pimenta"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/15791606?v=3", "user": "zemiguel23", "name": "Miguel Carvalho"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/19785973?v=4", "user": "eliax93", "name": "Elias Maia Azevedo Dias Ferreira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/19193264?v=3", "user": "davidroc", "name": "David Manuel Da Rocha Camelo"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/28763038?v=3", "user": "fabio24silva", "name": "Fábio José da Rocha Silva"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/3999751?v=4", "user": "sleepy105", "name": "Luís Sousa"}], "image": "https://i.imgur.com/EZZQqM3.jpg", "repo": "", "owner": "fpimenta", "intro": "A network of air quality sensors to generate a real-time profile of pollution levels all 'round the city. By receiving and treating this data frequently, we know the best routes to avoid getting as much harmfull pollutants as possible, knowing the changes on the pollution levels in every street, responding to the dynamic nature of the air.", "video": "", "active": true, "id": 35, "description": "Imagine a network of sensors to measure air quality, each sensor sending its location and data to the grid. These sensors can be placed everywhere, can be static or dynamic, placed on poles or buses.  Using this data **Breath** will be capable of generating an air profile of the city, responsive to changes in air conditions. This way we can know which route is the best to go for a jogging or to work getting as less cell mutations as possible. Not only every year there are a lot of pollution related deaths that can be reduced if we can profile air quality, giving the users the chance to avoid certain parts of the city will also improve the city life experience. This also serves as a call to action, profiling which part of the city needs the most immediate attention. \n\nPollution is a growing concern and by analysing this data and providing an interface so every one can access it, we can improve people's lifes.", "name": "Breath", "created_at": "2017-09-29 17:03:37.407000", "wallet": "2fa4c0c02daee32a9860dd5f3affc731682389ed"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/32246419?v=4", "user": "leticiaviegas", "name": "Leticia Viegas"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/31960606?v=4", "user": "pedroalexribeiro", "name": "Pedro Alexandre Ribeiro"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/32000464?v=4", "user": "jmes45", "name": "João Sarmento"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/7083271?v=4", "user": "gaborod16", "name": "Gabriel Amarista Rodrigues"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/32246849?v=4", "user": "filipepires98", "name": "Filipe Pires"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/25351750?v=4", "user": "enamak", "name": "Gonçalo Borges de Miranda Vítor"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/32276956?v=4", "user": "fcisca", "name": "Maria Francisca Abrantes"}], "image": "https://i.imgur.com/QhBUsya.jpg", "repo": "https://Enamak@bitbucket.org/Enamak/pixelsproject.git", "owner": "filipepires98", "intro": "The Network Game aims to confort future and present Pixel attenders by providing them an oportunity to connect more easily  with this community.", "video": "", "active": true, "id": 19, "description": "Maybe any group from the camp's community can be a part of this year's great projects, we're out to see if we're up for the challenge by proposing a website feature / mobile app called The Network Game. Getting to know people from the event has never been so easy, with the help of TNG and the Bios of each person attending Pixels Camp. \n\nEach player get's to see who comes from the same city as them, who's interested in similar activities and more, facilitating their search for teammates and workgroups. \nWith a gamification approach, we established challenges for users motivating them to interact with each other and recieve rewards in TNG that can be 3D printed as pieces of your own Pixels trophy.\n\nStay tunned or visit us to find out how much we can learn here.\n\nthe Network Game's group", "name": "The Network Game", "created_at": "2017-09-28 22:58:49.552000", "wallet": "3e69f61e75db75db085192f59f751064a3cf4e55"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/1765609?v=4", "user": "rui-teixeira", "name": "Rui Teixeira"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/30073044?v=4", "user": "domingosrodrigues", "name": "Domingos Rodrigues"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/30073044?v=4", "user": "domingosrodrigues", "name": "Domingos Rodrigues"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/1774170?v=4", "user": "tiagogala", "name": "Tiago Gala"}], "image": "https://i.imgur.com/PNQBZi2.png", "repo": "", "owner": "domingosrodrigues", "intro": "Online 3D printing platform featuring COLABORATIVE modeling and LIVE printing ", "video": "", "active": true, "id": 47, "description": "We as a team believe that community work and sharing is the future!\nAs such we devoted our efforts to applying that to our favorite method of manufacturing, addictive manufacturing, by making an online platform that allows several people to interact and design a 3d model live, while the same 3d model is printing. \nSuch a project can be very important for development teams that are unable to meet up and/or want a fast way to combine ideologies, for a school so that students can improve their teamwork and coordination and at the same time having a visual stimulus to aid in the learning process, for the industry to allow several engineers to cooperate in the design of a functional part or even integrate a designer so that both form and function can be achieved much quicker.\nThis prototype we are developing serves as a example for what can be achieved when a community, in this case Pixels Camp attenders, can do when working together.\n", "name": "Pixels Camp Community Cup", "created_at": "2017-09-30 04:54:53.854000", "wallet": "050c54ddcc30416f369a2b03eacf3e5744f55ae3"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/167298?v=3", "user": "killmaster", "name": "Carlos Martins"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/1004528?v=3", "user": "mjamado", "name": "Marco Amado"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/10657720?v=4", "user": "joanarijo", "name": "Joana Rijo"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/16014923?v=3", "user": "afonsus1997", "name": "Afonso Muralha"}], "image": "https://i.imgur.com/4lB02BJ.png", "repo": "", "owner": "killmaster", "intro": "A new and intuitive way of interacting with your smart.", "video": "", "active": true, "id": 28, "description": "A multiplatform dashboard to control and oversee your smart.                                                                                      \nWith our app you'll be able to:                                                                                                                   \n  - check the current status of your car (locked/open doors, battery, fuel level, etc)                                                              \n  - interact with your car (lock and unlock your car, turn on the lights, buzz the horn, etc)                                                       \n  - find your car                                                                                                                                   \n  - prevent your car from being taken, by automatically imobilizing it                                                                              \n  - vast range of features not on display at time of presentation due to current API constraints \n\nMade as a building block for our vision of a more practical, connected, and simpler way to interact with your car.\n\n![shows the current status](https://i.imgur.com/evfmbkg.jpg \"Main page\")\n\n![the door opened](https://i.imgur.com/RFYLKFt.jpg \"Open door\")\n\n![shows the car current location](https://i.imgur.com/0phjIYP.png \"GPS Tracking\")\n\n![keeps your car, yours](https://i.imgur.com/sxL7J2S.jpg \"Secure parking active\")\n\n\n", "name": "mysmart", "created_at": "2017-09-29 14:13:19.391000", "wallet": "bf3f18cf5564a1f1f06a26669a7e6c2bfe8223c0"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/1808303?v=4", "user": "luisfernandes", "name": "Luis Anselmo Fernandes"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/8426644?v=4", "user": "jcdesousa", "name": "José de Sousa"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/1772134?v=4", "user": "andrejnsimoes", "name": "André Simões"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/25867442?v=4", "user": "djmartins-dev", "name": "David Martins"}], "image": "https://i.imgur.com/gqNHE2b.png", "repo": "", "owner": "luisfernandes", "intro": "Build apps that react to the physical world positioning, geofencing and event triggering.", "video": "", "active": true, "id": 38, "description": "# Global Beacon\n\nThe Global Beacon app enables users to create autonomous interactions between entities of the physical world.\n\nAdd rules and switches, integrate to 3rd party APIs, connect to social media, automate IoT devices…\n\nGlobal Beacon offers a clean and contemporary to suit a range of purposes from corporate, tech startup, marketing site to digital storefront.\n\n* Quick and seamless way to connect the physical world to the digital\n* Get a kit on a retailer store (Hub + Beacon)\n* Connect the Hub to the Network\n* Go to Our website and register the beacon \n* Trigger IFTTT actions of more than 500 services or third party api’s\n\n[![Global Beacon](https://img.youtube.com/vi/3LRGi9Etvuw/0.jpg)](https://www.youtube.com/watch?v=3LRGi9Etvuw)", "name": "Global Beacon", "created_at": "2017-09-29 19:00:30.387000", "wallet": "02b34805f19e074a0eb1e0f275377591f5a6d996"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/21231482?v=3", "user": "barca88", "name": "Marco Gonçalves"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/21231482?v=3", "user": "barca88", "name": "Marco Gonçalves"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/11518950?v=3", "user": "45yoda", "name": "João Cabo"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/11543529?v=3", "user": "simbs38", "name": "André almeida gonçalves"}], "image": "https://i.imgur.com/i5M9KAz.png", "repo": "https://github.com/45Yoda/ToTheMoon", "owner": "barca88", "intro": "The man who shot for the moon. (he dead now btw)\n", "video": "", "active": true, "id": 33, "description": "Moon launcher is an simples but addictive game where the goal is simple, to reach the moon.\n", "name": "Moon Launcher", "created_at": "2017-09-29 15:15:44.277000", "wallet": "ca1e73ccbb21ef5c99eaed5691b23cecdae5b7b8"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/1107697?v=3", "user": "queimadus", "name": "Bruno Maia"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/2140264?v=4", "user": "lldh", "name": "Leonora Henriques"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/1187242?v=3", "user": "jd557", "name": "João Costa"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/143188?v=3", "user": "jcazevedo", "name": "Joao Azevedo"}], "image": "https://i.imgur.com/PJ5kDTE.png", "repo": "", "owner": "jd557", "intro": "Real-time and historical dashboard that shows the quality of Wi-Fi in the Pixels Camp Venue. \nCheck the live demo at http://bit.ly/pixels-wifi", "video": "", "active": true, "id": 44, "description": "Dashboard that presents real-time and historical data about the Wi-Fi status on the Pixels Camp Venue.\n\nDo you want to know:\n* Which Wi-Fi hotspots have less noise?\n* Which zones of the venue are less crowded?\n* Which talks had a larger audience? Which ones had their audience leave midway?\n\nThen fear not, this project is exactly what you've been looking for!\n\nCheck the live demo at http://bit.ly/pixels-wifi", "name": "Pixels-WiFi", "created_at": "2017-09-29 23:42:09.493000", "wallet": "aee294c4bed20209d5a66add5a77ae482db872f5"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/38172?v=3", "user": "braposo", "name": "Bernardo Raposo"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/31735?v=4", "user": "pgaspar", "name": "Pedro Gaspar"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/4189?v=3", "user": "fredoliveira", "name": "Fred Oliveira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/212106?v=3", "user": "dmfrancisco", "name": "David Francisco"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/12226628?v=3", "user": "mariamargarida", "name": "Maria Margarida"}], "image": "https://i.imgur.com/edFprnB.png", "repo": "https://github.com/braposo/pixelsart", "owner": "braposo", "intro": "Generative art from Pixels Camp user profiles", "video": "", "active": true, "id": 50, "description": "The Pixels Camp experience is something people will always remember, but we'll give a little help and create a personalised poster for each participant!", "name": "PixelsArt", "created_at": "2017-09-30 10:30:42.695000", "wallet": "944b8423331d5fb9713095e6a17390c2c6c4a1a7"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/3732744?v=4", "user": "marco-ramos", "name": "Marco Ramos"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/31097059?v=4", "user": "missksy", "name": "Cecília Santos"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/3951056?v=4", "user": "tcarita", "name": "Tiago Carita"}], "image": "https://i.imgur.com/2AATBc8.jpg", "repo": "", "owner": "tcarita", "intro": "Remote Vital Signs Monitoring using distributed sensors and high efficiency Low Power Radio to monitor  New Borns and patients that are bedriden or with limited in comunication.", "video": "", "active": true, "id": 49, "description": "This system is composed by a network of multiple physical devices with several sensors that connect to base station using low power high efficient radios.\nThese Base stations monitors all connected devices and processes data, issues warnings and communicates with other platforms.\n", "name": "Vital Signs Remote Monitoring", "created_at": "2017-09-30 10:21:19.333000", "wallet": "7bd23654e8199bfef55ff91831841baed69946af"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/6805669?v=4", "user": "gclz", "name": "Gonçalo Louzada"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/1015816?v=4", "user": "jlbribeiro", "name": "José Ribeiro"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/887454?v=3", "user": "dethos", "name": "Gonçalo Valério"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/4594879?v=4", "user": "budgerous", "name": "Pedro Janeiro"}], "image": "https://i.imgur.com/Y3LrEQq.jpg", "repo": "", "owner": "gclz", "intro": "Where did all this EXP came from? ExposureGate is the operation to uncover transaction patterns within the Pixels Ethereum Network.", "video": "", "active": true, "id": 37, "description": "# ExposureGate\n\nExposureGate is the ongoing operation to **uncover transactions patterns** within the Pixels Ethereum Network (PEN). Given the unusual amounts involved in the Pixels Camp Hackathon, this operation aims to make it **easier to understand where the money is coming from, and where it is going to**. \n\nBy using the transparency of the PEN it is possible to cross-reference data and render it graphically so it becomes clear to everyone if there is any \"irregularity\" behind the sucess of a project or investor. Exposure laundering? Lobbying? None of that will go unnoticed with ExposureGate.\n\n### Who is ExposureGate for?\n\nThe audience is everyone involved in the Pixels Ethereum network.\n\n### The Tech\n\nFor this we used Node.js, Web3.js, Socket.io and more stuff we'll add here soon.\n\n![nixon](http://media.beam.usnews.com/1a/57/6a58d9d944ad89501dc2685cb7b2/140806-nixonquiz-intro-editorial.jpg)", "name": "ExposureGate", "created_at": "2017-09-29 18:08:48.182000", "wallet": "9fd2160e94bb27c187ed97c47c56993129761db4"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/1038123?v=4", "user": "fmendes75", "name": "Francisco Mendes"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/8653720?v=4", "user": "ricdays", "name": "Ricardo Dias"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/17902658?v=4", "user": "3devangelist", "name": "Ricardo Pereira"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/1459103?v=4", "user": "mmemetea", "name": "Michaël MEMETEAU"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/21983166?v=4", "user": "pnmagalhaes", "name": "Pedro Nuno Ferreira Magalhães"}], "image": "https://i.imgur.com/UjzWypK.jpg", "repo": "https://github.com/HardwareCity/Falcon9_Electric_Fun", "owner": "fmendes75", "intro": "Elon Musk - \"Using a \"BFR\"(Big Fucking Rocket) we can fly anywhere on Earth in under an hour.\"\nWe can do better! Our SFR(Small Fucking Rocket) can deliver an urgent cargo, like medicine in less then 10min with in Lisbon.\nOur system use AR technology for users to access info about the content of the system.\n", "video": "https://youtu.be/WNB4gkvHzpM", "active": true, "id": 7, "description": "# The ultimate goal: \n**Elon Musk. Using a \"BFR\" flying at a max speed of 18,000 mph, he says we could fly anywhere on Earth in under an hour.**\nhttps://www.engadget.com/2017/09/29/elon-musk-spacex-bfr-travel-earth/\n\n# Work in progress....\nCheck our progress @ **Hardware City** boot. (the big space with lots of Makers & 3D printers)\n\n[Github](https://github.com/HardwareCity/Falcon9_Electric_Fun)\n\n# UPDATES \n\n## Day 2: 17h39\nAugmented Reality Engine is working!\nhttps://youtu.be/WNB4gkvHzpM\n\n## Day 2: 12h26\n**Turbo-fan working!**\nhttps://youtu.be/jdALEW8YUmo\n\n## Day 2: 11h23\nClosed-loop PID control implemented. PID parameters are easily configurable for fine-tuning.\n\n## [Day 1 - 23:15 ]\nWatch the video\nhttps://youtu.be/e8KSoybVmzY\n\nWe already have a BETA version of our basestation control system, based on **Microsoft Kinect One** , using the **PCL (Point Cloud Library)** for 3D detection of our prototype. The tool already allows the user to interact, identify the rocket prototype using a weighted centroid-based approach and track it iteratively. \n\nNext step: add a Kalman Filter to filter noisy observations.", "name": "Falcon 9 Electric Fun", "created_at": "2017-09-28 15:38:15.669000", "wallet": "8bb4b1e8f8b35aea3db8d6139e6c674efdd97a6f"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/9087231?v=3", "user": "penelopeg", "name": "Penélope Gonçalves"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/21367039?v=3", "user": "gjordao", "name": "Gustavo Jordão"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/16197190?v=4", "user": "joaomff", "name": "João Filipe"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/10214956?v=4", "user": "soulwarlord", "name": "André Lascas"}], "image": "https://i.imgur.com/HyQtfM9.png", "repo": "https://github.com/GJordao/Pixapp", "owner": "penelopeg", "intro": "We're on the 2nd edition of Pixels Camp and there's no app for it?\nNow there is!", "video": "", "active": true, "id": 36, "description": "It's pretty simple: If it exists, there must be an app for it.\n\nPixels Camp website is great. Really. But we hate to use browsers in our smartphones, specially when there's no internet around.\n\nAre you tired of never getting the alert to work out and earn freebies? You can receive push notifications every time there is an alert on the event. Did you miss the talk you really wanted to see because you completely spaced out while eating noodles? Receive a notification 5 minutes before! Do you have no idea how to do EXP transactions, or what the hell is a wallet? If you know the person's username, that's all you need to transfer EXP!\n\nPIX_app allows you to easily access all the information you need in order to enjoy Pixels Camp at its maximum: Your exps, your badges, your personalized schedule.", "name": "PIX_app", "created_at": "2017-09-29 17:43:20.050000", "wallet": "317eb5c1dcd59c6ce6ed247b6e256cb35e99e60c"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/6299166?v=4", "user": "bomany", "name": "Filipe Reis"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/5568952?v=3", "user": "pescadjiam", "name": "Miguel Pescadinha"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/6217708?v=3", "user": "jorgealves", "name": "Jorge André Alves"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/13222966?v=3", "user": "joaofguerreiro", "name": "João Guerreiro"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/12819467?v=3", "user": "jsilveiro", "name": "João Silveiro de Oliveira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/9846270?v=3", "user": "marcojusto", "name": "Marco Justo"}], "image": "https://i.imgur.com/9eKkKmQ.jpg", "repo": "", "owner": "pescadjiam", "intro": "Are you in a rush? Lost your keys inside your bag? Karl is here to assist you.", "video": "", "active": true, "id": 48, "description": "The Karl Assistant is available as an Android app, connecting you to your Mercedes through voice recognition.\n\nHere’s how you can interact with your Mercedes:\n\n    - Open and close doors\n    - Blink orange lights to help you find it\n    - Engage / Disengage the handbreak and steering\n\nAnd also you can make it dance!!\n\n[Video soon]", "name": "Karl Assistant", "created_at": "2017-09-30 09:26:30.344000", "wallet": "36b893ce2b5e784158e7511b0192f56ce1077c07"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/26525162?v=4", "user": "mariana-kikloki", "name": "Mariana Fernandes"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/31745443?v=4", "user": "costeiira", "name": "Gonçalo Costeira"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/9318723?v=4", "user": "herulume", "name": "Eduardo Jorge"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/25423909?v=4", "user": "pimonteiro", "name": "Filipe Monteiro"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/24685545?v=4", "user": "phansti", "name": "José Alves"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/30596292?v=4", "user": "dunnadan", "name": "Marcio Sousa"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/30029667?v=4", "user": "alexrc1703", "name": "Alexandre Reis Costa"}], "image": "https://i.imgur.com/I8qR40U.jpg", "repo": "", "owner": "mariana-kikloki", "intro": "We transform network traffic into music!\n", "video": "", "active": true, "id": 43, "description": "Why do we transform network traffic into music, you ask? Because we can!", "name": "Nethoven", "created_at": "2017-09-29 23:32:44.882000", "wallet": "16509ccf7a2002f5f25de4915be08ffd3b8656f5"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/498050?v=4", "user": "mgontav", "name": "Miguel Tavares"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/14932142?v=4", "user": "agrancho", "name": "Alexandra Grancho"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/1047541?v=4", "user": "dpflucas", "name": "Diogo Lucas"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/51695?v=4", "user": "rafaeljegundo", "name": "Rafael Jegundo"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/1325415?v=4", "user": "danielflopes", "name": "Daniel Lopes"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/11708251?v=4", "user": "kabombom", "name": "Miguel Machado"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/255686?v=4", "user": "jpgbarbosa", "name": "João Barbosa"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/756694?v=4", "user": "samuelmoreira", "name": "Samuel Moreira"}], "image": "https://i.imgur.com/Ghfd6Ax.png", "repo": "https://github.com/whitesmith/qoop", "owner": "mgontav", "intro": "A parallel, de-centralized economy for meal sharing that focuses on the real value of food: the joy of cooking, gathering and sharing. ", "video": "", "active": true, "id": 15, "description": "\n# The Idea\n*Eating is not about the money, and it shouldn't be.* \n\nIt's about the joy of cooking, gathering around a table and sharing a meal. Its intrinsic value should be on the idea of the meal itself and the social interaction that arises, not really about how much €€€ it costs.\n\nQoop is the app that makes it all possible, allowing everyone to share meals, getting other meals in return, disregarding monetary transactions and focusing on creating a parallel, _de-centralized Ethereum-based token economy for meal-sharing that holds itself together with the reliability of Smart Contracts._\n\nOn top of that, we also try to make the world a slightly better place.\n\n# How it Works\n_Qoop makes it easy to share meals with your friends, co-workers and neighbours._\n\nWhen you're cooking and notice you've made enough for a few extra guests, just fire up the app and create a new shared meal. Every one of your friends using the app will be notified that something _yummy_ is cooking and can join in. Unless all the spots are taken. In that case, better luck next time.\n\n![](https://raw.githubusercontent.com/whitesmith/qoop/master/app/assets/images/description-1.png)\n\n_But sharing isn't just taking. It's also giving back._\n\nTo join a meal, guests have to make sure the host gets a bit more than their delightful presence. In Qoop, meals are shared using `FUD`, a decentralized coin living on the Ethereum network. `1 FUD -> 1 Meal`, no exceptions, because memorable dinners are not the expensive ones, but the fun, the romantic, the lively, the bohemian ones.\n\nAt the end of the meal, everyone confirms that it was as awesome as expected, and the host gets his `FUD`. Now the cycle can keep going on and on, trading tokens for engaging meals, conversations and memories.\n\n_But where does `FUD` come from?_\n\nMeals can't be given away for free (unfortunately), so to get those first `FUD` tokens to get you started, guests and cooks alike can just fire up the app and trade `ETH` for tokens. The value is symbolic (`0.015 ETH -> 1 FUD`) and gets a lot more done than you're thinking right now. Just keep reading and you'll see.\n\n![](https://raw.githubusercontent.com/whitesmith/qoop/master/app/assets/images/description-2.png)\n\n# Sharing Locally and Globally\n\nIn our vision food is fuel, but meals are nurture and a pillar for our intrinsic social nature. With the meal sharing portion of the app, we hope to connect those that have enough to share in meaningful moments.\n\n_However, we are deeply aware that not everyone has enough to eat, much less to share._ So let's take the opportunity given to us by Qoop, and change it.\n\nThe opportunity we are presented with is `ETH`, the one that is spent to buy `FUD` tokens. From the pool of `ETH` collected through the app, _the Qoop team pledges to give 50% of the collected `ETH` to charitable foundations that help feed those that can't feed themselves._ In a way, when you're getting your tokens, you are getting meals for yourself, but also for someone that really can't afford it.\n\n![](https://raw.githubusercontent.com/whitesmith/qoop/master/app/assets/images/description-3.png)\n\nWhat about the other 50%? For us this isn't about the profit, so we reserve that 50% for users that want to exchange their `FUD` back to `ETH` (at half the exchange rate, to account for the donated slice). So if you're a serial cooker, don't worry, you won't be swimming in so much `FUD` you won't breathe.\n\n### Qoop in a nutshell\n* Forget about the money and trade meals directly for other meals.\n* Fund charities with goodwill money.\n* Enjoy the conversation, the food, and laughs with your friends and colleagues.\n\nQoop is now available at [http://qoop.herokuapp.com](http://qoop.herokuapp.com). It's one of those _heavy alpha_ versions, but go ahead and give it a spin.\n\n# Under the Hood\n\n_Now for the nitty-gritty. GH Repo is here - https://github.com/whitesmith/qoop_\n\n### FUD\nThe `FUD` token is an [ERC20](https://theethereum.wiki/w/index.php/ERC20_Token_Standard) compliant token, living for now in the Pixels Camp Ethereum Testnet. You can find the smart contract living at `0x00776a1d0759cb697111b0132731d058f3e67299`. If you want you can see [the source code for the contract](https://github.com/whitesmith/qoop/tree/master/contracts), as well as its JSON interface so you can call it directly if you want.\n\nAdditionally to the ERC20 methods, this contract also specifies the `buy` and `sell`methods to make the `ETH <-> EXP` transactions and a couple of extra functions to deal with creating and managing meals.\n\nThis contract is defined so half the received `ETH` is credited to its owner, so the charitable donations can be performed using `ETH` or some fiat currency. In the future we hope to be able to interact with other smart contracts deployed by charities, so we can keep accountability at a maximum.\n\n### Meal Contracts\nShared meals are defined as a [separate contract](https://github.com/whitesmith/qoop/blob/master/contracts/MealContract.sol) that is instantiated every time someone creates a new meal. So every shared meal is a separate contract where cooks and guests can interact to join, approve and close the meal.\n\nWhile this contract is active, all the `FUD` associated with it is held in escrow by the contract itself. When all participants approve the meal (after it happens), all the `FUD` tokens are transferred to the cook and the contract self destructs.\n\n### Web/Mobile App\nThe Qoop app is built using Ruby on Rails, for a bare-bones backend where we can store additional information regarding meals. Since all the business logic is done in the smart contract themselves, most of the data stored is cosmetic (pictures, names, descriptions).\n\nInteraction with the smart contracts is done on the client side, using [web3.js](https://github.com/ethereum/web3.js/), with optional interactions with Metamask for transaction signing.\n\nTo get it looking pretty for the PC and mobile, we built it over [Bulma](http://bulma.io/) which is pretty awesome according to both our engineers and our designers.\n\n# FAQ\n\n**Q: Can you shed some light on how this idea came to be?**\n\n_A: Basically, a couple of months ago a couple of the idle minds at [Whitesmith](https://www.whitesmith.co/) thought that it would be cool to make an app to help with sharing homemade meals at the office. Like most ideas by idle minds, that never came to be._\n\n_When we got the word that Pixels Camp was gonna revolve around Blockchain, we thought it would be the perfect time to finally get the idea off the ground and get our feet wet on Ethereum and Smart Contracts (yep, first timers in `ETH` here, please be don't be harsh)._\n\n**Q: This is pretty cool, but can I get a TL;DR?**\n\n_A: Well, you basically stop paying for meals with money and start trading it for other meals. In the process you feed hungry people and if everyone starts using it, soon eating a meal will be a completely money-free event._\n\n\n**Q: Are you really donating anything to charity? What keeps you from hoarding the `ETH` to yourself?**\n\n_A: Right now, no, we are not donating. Mainly because this still lives in the Pixels Camp Testnet and the `ETH` here is worthless. And when we migrate this to the real deal, we are looking at a more accountable approach to donating, like transferring the `ETH` directly to a charity. Ideally, it would go towards some smart contract enforcing humanitarian aid for hunger relief._\n\n\n**Q: Isn't the meal contract a bit barebones? Shouldn't info on the meal also live on the blockchain?**\n\n_A: Great question, and one we haven't been able to figure out ourselves. Right now we can see that more information on the meal (at least location and short description) should be stored, to prevent tampering with the contract. But we also get that storing too much data on the blockchain is expensive (gas), so we were left wondering. If you're able to help us out here, we'd love to chat._\n\n**Q: This project is awesome and I want to help! Is this going to live past Pixels Camp?**\n_A: We certainly hope so, as half of its interest resides on it dealing with real value that can be put to good use. Reach out to us on `#qoop` on the Pixels Camp Slack, on [Github](https://github.com/whitesmith/qoop) or just talk to us directly, this is one of those projects that thrives on community, so come help._\n\n## Backer Rewards\n\n_Are there any backer rewards?_\n\nWell, all our funders are more than welcome to join us for a meal at our HQ in Coimbra or at the next Pixels Camp. Just give us a call and we'll make it happen.", "name": "Qoop - Qooperative Qooking", "created_at": "2017-09-28 19:53:02.119000", "wallet": "2db3b66ae8bcc3110850d699d5f694332cf717c0"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/17574157?v=4", "user": "joaolages", "name": "João Lages"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/15204479?v=4", "user": "yessafab", "name": "Andrea Fabbiani"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/28752143?v=4", "user": "tomasgrilo", "name": "Tomás Grilo"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/16405921?v=4", "user": "brada1703", "name": "Brad Ahrens"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/12519843?v=3", "user": "colobas", "name": "Guilherme Pires"}], "image": "https://i.imgur.com/OlAAqIS.png", "repo": "", "owner": "brada1703", "intro": "The biggest, the best, and the only Exposure PixelsCamp Hedge Fund guaranteed to invest in the best projects.\nFor more info: pixelsfund.github.io", "video": "https://www.youtube.com/watch?v=ZO_wYW8Me5Y", "active": true, "id": 5, "description": "# Pixels Fund\nThe __biggest__, the __best__, and the only __Exposure PixelsCamp Hedge Fund__ guaranteed to pick the best projects.\n\n###### _no guarantees actually apply._\n\nHow does it work?\n\n* Savvy investors choose Pixels Fund to manage their EXP endowment.\n* During the competition, these investors relax, rest assured that their funds are being invested wisely.\n* Before the end of the competition our crack squad of financial geniuses invests the fund optimally.\n* After the funds are distributed, Pixels Fund will distribute earnings to our investors.\n\nHow can I invest?\n\n1. [Go to your wallet](https://wallet.pixels.camp/#send-transaction)\n2. Enter your Private Key\n3. Click Unlock\n4. Copy our address: `0x51bdb634ab627f79cc0166cc0bab0cd29f6d8294 `\n5. Enter the Amount\n6. Enter Gas Limit\n7. Click Generate Transaction\n8. Scroll down\n9. Click Send Transaction\n\nHow do earnings work?\n* We wrote a smart contract that registers investors' deposits and automatically splits any dividends to investors after the winners are announced.\n* Dividends are distributed based on participation in the fund, using the following formula: (Investor's Participation/Total Fund) \\* Total Earnings\n* A small fee will then be charged prior to distribution, resulting in a 70/30 split, in which investors receive 70% and the fund keeps 30%.\n\nFor more information:\n[Site](https://pixelsfund.github.io/),\n[Video](https://www.youtube.com/watch?v=ZO_wYW8Me5Y)\n\n<center>\nPowered by: \n<br>\n<img src=\"https://pixels.camp/img/pixelscamp_dark.svg\" alt=\"Drawing\" style=\"width: 50px;\"/>\n</center>", "name": "PixelsFund", "created_at": "2017-09-28 14:12:28.696000", "wallet": "e84dc483a0cdd4e8bb0d8af934a30fac2ae01452"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/12899358?v=4", "user": "bdiogo", "name": "Beatriz Diogo"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/9062560?v=4", "user": "tiagoaryan", "name": "Tiago Aryan"}], "image": "https://i.imgur.com/dvHFlNl.jpg", "repo": "", "owner": "tiagoaryan", "intro": "Pixel Empire is a mobile game in real-time strategy, MMO game, that start in the stone age with the purpose of reaching the moon.", "video": "https://youtu.be/-BiXr4AOok8", "active": true, "id": 13, "description": "__Pixel Empire__ is a mobile game in real-time strategy, massively multiplayer online game, that start in the stone age with the purpose of reaching the moon. \n\nThe game is set with each player starting only with an _pixel hero_ that establish a new village, with the objective being to slowly expand and the ultimate goal, of gathering enough resources and technologies to take a rocket to the moon, while defending the village from armies of other players. \n\nThe game also allows for a level of player-specific customization.", "name": "Pixel Empire", "created_at": "2017-09-28 18:55:29.485000", "wallet": "a1ac6fd7188918240fedc7c4abac6166034f2e49"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/26142827?v=4", "user": "nexturn", "name": "Gil Cunha"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/26050179?v=3", "user": "egrocha", "name": "Eduardo Rocha"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/17438769?v=4", "user": "mgcsousa", "name": "Manuel Sousa"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/17438769?v=4", "user": "mgcsousa", "name": "Manuel Sousa"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/30631606?v=4", "user": "cppedrosa", "name": "Carlos Pinto Pedrosa"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/28629435?v=4", "user": "snow97", "name": "Ricardo André Araújo Neves"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/20323617?v=4", "user": "davidjsousa", "name": "David Sousa"}], "image": "https://i.imgur.com/s6FeSyw.png", "repo": "", "owner": "mgcsousa", "intro": "Wordust is a typing based game, which consists in typing words as quickly as possible before they hit the other side of the screen. ", "video": "", "active": true, "id": 51, "description": "Wordust challenges people to get their accuracy and typing skills as sharp as possible. The more you progress in the game, the harder and faster it gets. More words keep coming from the right side of the screen, and you are challenged to write them all with no errors allowed. If you keep typing and scoring, multipliers will appear, and will help you get more and more points. If you start failing, your points will start to drop. If, however, you take too long to type, you will allow words to get to the other side of the screen, losing you a life point. You start with 3 life points, so manage them wisely.", "name": "Wordust", "created_at": "2017-09-30 11:54:22.993000", "wallet": "b860208c07718d6cd6f0cc4a6cfacde99ac6674a"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/18195777?v=3", "user": "jrebocho", "name": "Jorge Rebocho"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/1025661?v=4", "user": "trenpixster", "name": "Nizar Venturini"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/1697301?v=3", "user": "filipecabaco", "name": "Filipe Cabaço"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/1503499?v=3", "user": "williamrjribeiro", "name": "William R. J. Ribeiro"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/134690?v=4", "user": "ivogomes", "name": "Ivo Gomes"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/1440120?v=4", "user": "joaovasques", "name": "Joao Vazão Vasques"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/2973056?v=4", "user": "anmo", "name": "Bruno Tavares"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/7104619?v=4", "user": "andygoncalves", "name": "Andy Gonçalves"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/3422400?v=4", "user": "sashaafm", "name": "Sasha Fonseca"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/18385?v=3", "user": "cog", "name": "José Castro"}], "image": "https://i.imgur.com/Se1ZoFw.png", "repo": "https://github.com/filipecabaco/caniagree", "owner": "cog", "intro": "Crowdsourcing Terms & Conditions' reviews and pointing out the bits you *really* need to know.", "video": "", "active": true, "id": 6, "description": "# caniagree - WIP\nCan I Agree?\n\n\nWe allow people who do read Terms & Conditions to vote (or comment) on the safety of each paragraph.\n\nWe can then collapse the safe parts and highlight the unsafe ones.\n\nThink of a web where Terms & Conditions actually have meaning.\n\nThink of a web where companies know which paragraphs of their Terms & Conditions actually make their users angry.\n\nThink of comparing the red flags of several similar services.\n\nThat's what we're aiming for! A safer internet experience for all of us!\n\nElixir, Phoenix framework, React, Redux, and Postgres. Our team include backenders, frontenders, and a usability expert.\n\nMore information at https://github.com/filipecabaco/caniagree\n\n\n# launch plan\n\n 1. closed beta, invitation only\n 1. open platform\n 1. trusted network of advisors, where your trusted contacts' votes have a much higher meaning than the ones from the rest of the community\n\n\n# future work\n\n 1. Compare between different services, so you can choose, for instance, whether you want to upload your videos to Youtube or Vimeo\n 1. Implement the service for software licenses, and also allow for comparison of TOS between different services (\"Should I go with AWS, Azure, or Google Cloud?\"; btw: AWS, 34k words)\n 1. Implement the service for legal contracts (\"Which Internet provider do I want to go with?\"; tip: look for the \"responsible use policy\" items)\n\nThere are also other functionalities we need to work on, namely taking care of updates to TOS and gather different terms from the same product in one place (Terms & Conditions, Privacy Policy, Cookies Policy, etc).\n\n\n# business plan\n\nWe have come up with several ways of monetizing this project; these are our favorite two right now:\n\n 1. Companies may pay to display their services when someone is looking into policies for other similar services\n 1. Users may pay for certain comparisons (\"Which of these 20 magazines should I try to sell my stories to? What are their terms when it comes to intellectual property?\")\n", "name": "Can I agree?", "created_at": "2017-09-28 14:32:50.015000", "wallet": "6720f8fc5383c838ec1b52812bc83fed5d315b85"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/28740491?v=3", "user": "sork1st", "name": "Carlos Delgado"}], "image": "https://i.imgur.com/6NvmGsi.jpg", "repo": "", "owner": "sork1st", "intro": "Please someone train my neural network to create a random project based on the seeds off all the sponsors. \nOr create a new one… all we believe that ideas and technology will change the bit-chains that we try to imprison ourselves with.", "video": "", "active": true, "id": 46, "description": "Let´s try to increase the amount of opportunities and Distribute the system. \nNo i don't want to hack your brain, and this is not spam, please don't React that way.\nWe really just want to connect and share the same Wifi? \nLet's not force some Visual contacts in this cloud, and throw some abstract syntax, for breaking paradigms or consolidate the 3D Streaming we are progressive building to try  understand this Babel Tower off bit´s and pixels.\nWhat a powerful database we have here, the combination of ingredients, spotlights, and challenges, fill´s my reality with positive feedback and inputs. I just wish i could collect all the information we are sharing here.\n\nPs: i give all my Exposure to you, hope you accept these.", "name": "Random project generator", "created_at": "2017-09-30 00:23:47.953000", "wallet": "f6cc70b96091fde69cb3f76ba14cfa093586e1a2"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/22856481?v=4", "user": "simaonogueira101", "name": "Simão Nogueira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/29758130?v=4", "user": "monicawolters", "name": "Mónica Wolters"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/15388414?v=3", "user": "teresalazar13", "name": "Teresa Salazar"}], "image": "https://i.imgur.com/VDIABdm.jpg", "repo": "https://github.com/jeKnowledge/arbitrium", "owner": "simaonogueira101", "intro": "Arbitrium, the Slack bot here to make and help making your decisions.", "video": "", "active": true, "id": 40, "description": "Tough choice? Spending hours on end deciding on a restaurant? \nArbitrium, the Slack bot here to make and help making your decisions. \n\nWith an intuitive Google Sheets integration, create a list with the best alternatives, and we'll help you decide. Feeling frisky? Add an extra alternative for that particular instance.\n\n ⚠️ PARENT ADVISORY - Explicit Content ⚠️ \nWe may further indulge in Machine Learning and SuperDuperAwesome Algorythms to make this an even better decision making tool.", "name": "Arbitrium", "created_at": "2017-09-29 20:23:55.877000", "wallet": "0ca6181f146ba46fb53395751d73af3dafd6f60b"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/22317547?v=4", "user": "jgm-ramalho", "name": "João Ramalho"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/5073663?v=3", "user": "mika412", "name": "Mykhaylo Marfeychuk"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/5073663?v=3", "user": "mika412", "name": "Mykhaylo Marfeychuk"}], "image": "https://i.imgur.com/JvzR0Fl.jpg", "repo": "", "owner": "mika412", "intro": "A different way to access all the infomation about your car and control it through your smartphone using AR (Augmented Reality).", "video": "https://youtu.be/0U8thPqbwxA", "active": true, "id": 29, "description": "The mycAR app uses the smartphone camera and AR (Augmented Reality) to display all the pertinent information about your vehicle like: milage, battery and/or fuel range and location.\n\nIt can also control the locking state of the doors, all or each individually, the immobilizer and the state of the engine.\n\nIt's your car, do it your way.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         ", "name": "mycAR", "created_at": "2017-09-29 14:19:40.786000", "wallet": "85393ac09c21e35fab3984f97d1059f4d24b4065"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/22912300?v=4", "user": "davidvfilipe", "name": "David Filipe"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/22912553?v=4", "user": "joaoalmada", "name": "João Almada"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/32170485?v=4", "user": "ribeiro1303", "name": "Filipe Ribeiro"}], "image": "https://i.imgur.com/jOiqZUS.jpg", "repo": "", "owner": "davidvfilipe", "intro": "Sports injury prevention and rehabilitation through the use of Virtual Reality games. ", "video": "", "active": true, "id": 4, "description": "VR Sportherapy objective is to augment the health professional's job in relation to sports injuries by making home/clinic exercise routines easier and fun.\n\nThrough several exercise routines (minigames) custom fit to each sport, we intend to diagnose, treat and even prevent a number of sports related injuries like neck and wrist strains.\n\n- The exercise routines are separated by sport (Volleyball, Tenis, Boxe, Badminton etc.); \n- At the end of each routine a report is generated, in order to evaluate the patient's progress;\n- Through the use of games as a theme for the exercises, we aim to increase the patient's motivation and engagement.\n- Enable risk free training for lesioned athletes.\n \n", "name": "VR Sportherapy ", "created_at": "2017-09-28 13:15:19.479000", "wallet": "3522a0a3bcb363e5040dd49dac67b5c6b8f7463a"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/878752?v=4", "user": "petrhos", "name": "Pedro Cavaco"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/25556567?v=4", "user": "mrjootta", "name": "João Reis"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/29675912?v=4", "user": "ih95", "name": "Iqra Hamid"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/14454?v=3", "user": "stvkoch", "name": "Steven Koch"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/10234716?v=3", "user": "rogerfixeads", "name": "Rogerio Machado"}], "image": "https://i.imgur.com/V6Koimn.jpg", "repo": "", "owner": "mrjootta", "intro": "Let's make the world turn crypto?\nWe pretend to simplify the way you buy bitcoin.", "video": "", "active": true, "id": 32, "description": "Targeting for small amounts our online broker will make your bitcoin journey start simple, what we have are you thinking?\n\nThat's easy, a simple user friendly we where all you need is a valid bitcoin wallet. \n\nForget all the complicated stuff, we make your experience in cryptocurrency enjoyable, fast and secure, a way in where less is more. \n\nWith latest tech behind we make the complicated path disappears, securely and with low fees as possible guarantee.\n\nIt's Eezy.\n\nURL: <a href=\"https://eezycoin.com/\">Eezycoin.com</a>", "name": "EezyCoin", "created_at": "2017-09-29 15:14:22.808000", "wallet": "0795a532e56c054fc217c3fe4c4a9d744e2b8b8b"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/5691465?v=4", "user": "jtcosta", "name": "João Costa"}], "image": "https://i.imgur.com/Y4bhp1y.jpg", "repo": "", "owner": "jtcosta", "intro": "Ai on retail. Let's have machine learning tell us what fruit/vegetable is being weight. With that we improve the process that costs a lot of time, produces a lot of waste time on lanes, and improve happiness instore.", "video": "", "active": true, "id": 14, "description": ">UPDATE!\n>===================\n\n>Just added voice to the project - after scanning wouldn't it be nice to confirm that it's the correct product to add it auto to the clients cart? Stay tunned and comment cool features to add!\n\nAmazon go has made visible the state of automation we can achieve. I honestly believe that's a good thing - efficiency. I also believe that we, as a species, don't want to end up going to the shopping just to pick and collect - better have the groceries delivered then... I believe in the shopping experience! I also believe we should be thinking a lot more about it. I will try to tackle one of the first obstacles i can see in todays retail business using AI. After that I will tell you the story behind why i want to make this project - what i believe shopping might become, etc.\n\nTech Stack:\n\nAngularjs,\nExpressjs\nMicrosoft Custom Visions(ps. Xbox is mine :D ).\netc.\n\n![try](https://www.dropbox.com/s/04k6e49jbquytal/Screen%20Shot%202017-09-29%20at%2019.18.20.png?dl=1)\n\n", "name": "PixelsAI", "created_at": "2017-09-28 19:38:24.846000", "wallet": "23394774bc837465d0735692206324b052332b32"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/1596736?v=3", "user": "ktachyon", "name": "Tiago Matos"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/3187659?v=4", "user": "lalmachado", "name": "Luís Machado"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/4060283?v=3", "user": "jpcsousa", "name": "João Paulo Coimbra de Sousa"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/1596736?v=3", "user": "ktachyon", "name": "Tiago Matos"}], "image": "https://i.imgur.com/RpeuA7k.png", "repo": "", "owner": "ktachyon", "intro": "Gotta hatch ‘em all is a Pokémon GO helper app that will help you hatch eggs on wheels.", "video": "https://youtu.be/90YFntZP2C0", "active": true, "id": 45, "description": "Gotta hatch 'em all is an app you switch to from Pokémon Go to track the distance and speed in a straight line from a base position and allows users to know when they can re-open Pokémon Go to get the straight line distance to count towards egg hatching.\n\nCan also be used as a ruler for the world ;)", "name": "Gotta hatch 'em all", "created_at": "2017-09-30 00:05:11.044000", "wallet": "4601e64b7916f2eb1bf9228a19a85e02d702ba1b"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/195567?v=3", "user": "suskind", "name": "Claudio Gamboa"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/14289?v=3", "user": "celso", "name": "Celso Martinho"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/12426?v=4", "user": "edevil", "name": "André Cruz"}], "image": "https://i.imgur.com/CJcCzwo.jpg", "repo": "https://github.com/suskind/nobull/", "owner": "suskind", "intro": "Nobull is a Slack bot which translates Startup jargon into plain English using advanced machine learning technology and cognitive computing.", "video": "", "active": true, "id": 1, "description": "Nubull recognizes startup jargon in messages and rewrites the text so that everyone understands it. For instance:\n\n\"We will revolutionize the tourism sector\" will become \"We like to travel, know how to code, and have ideas,\" or \"Using state of the art machine learning\" will become \"We hear investors like machine learning, so we have that.\", or \"Disrupt\" will become \"Super fun and awesome.\"\n\nThe audience is everyone except founders and investors.\n\nTo accomplish Nobull we used NodeJS, Spark, React, BotKit, NeoVim, No tabs and 4 space indentation.\n\nWe trained our neural networks using datasets from several community websites like Hacker News and SVD.\n\n## URL\n\nhttps://nobull.io/\n\n## Other information\n\nThe caveat with Nobull is it can't process sarcasm in sentences yet; a common problem found in many of the Slack communities we tested the bot with. We are trying to solve this problem by using noisy Hopfield networks with holographic associative memory but it's still in alpha.", "name": "Nobull bot", "created_at": "2017-09-27 17:03:57.153000", "wallet": "55c433ac25a18384a2ac9e476c63f7e03371ba53"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/17356700?v=3", "user": "hugainz", "name": "Hugo Gonçalves"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/1722352?v=3", "user": "fntneves", "name": "Francisco Neves"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/11872606?v=4", "user": "xorty", "name": "Miguel Costa"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/19171562?v=3", "user": "jlsilva1994", "name": "José Luís Silva"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/8932463?v=3", "user": "franciscolira", "name": "Francisco Lira"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/17494742?v=3", "user": "diogocouto", "name": "Diogo José Linhares Couto"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/17356700?v=3", "user": "hugainz", "name": "Hugo Gonçalves"}], "image": "https://i.imgur.com/6gNr6T1.png", "repo": "", "owner": "hugainz", "intro": "Your shopping adventure starts here.", "video": "", "active": true, "id": 31, "description": "Ever thought of shopping as an adventure? Now it is.\n\nFeeling bored because you have to go shop for groceries? Fear not, cause we just turned shopping into adventurous fun.\n\nBy introducing gamification concepts into the user shopping experience, we created a brand new meaning for the everyday supermarket run.\n\nSounds interesting and a little bit mysterious? We meant to. Tune in for our pitch to know more ;P", "name": "Discover Your Store", "created_at": "2017-09-29 14:35:58.803000", "wallet": "2363a7f7e9eb6cb5a445be6b03c31b61aa3d2a13"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/1504388?v=4", "user": "davidoliveira", "name": "David Oliveira"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/8062666?v=3", "user": "hmrodrigues", "name": "Hugo Rodrigues"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/7884997?v=4", "user": "jodufra", "name": "Joel Francisco"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/22049329?v=4", "user": "fabiosantos14", "name": "Fábio Santos"}], "image": "https://i.imgur.com/EIkR9VH.png", "repo": "", "owner": "davidoliveira", "intro": "Make your career path certification track bullet proof with blockchain. ", "video": "", "active": true, "id": 8, "description": "Platform based on the most secure system world to assure the work career path in our lives. Special useful for track politicians education certifications (at least in Portugal).", "name": "LINKED CHAIN", "created_at": "2017-09-28 16:40:58.989000", "wallet": "609c0e60e9a0b0c3aa3d144c79ca0d301543010b"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/25415490?v=3", "user": "jhugobb", "name": "Hugo Brandão"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/11543581?v=4", "user": "9thscientist", "name": "Bruno Cancelinha"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/15841161?v=3", "user": "p3rsephone", "name": "Tânia Silva"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/25941014?v=3", "user": "a-sac", "name": "Sérgio Costa"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/17102689?v=3", "user": "zepedroresende", "name": "Jose Pedro Resende"}], "image": "https://i.imgur.com/f3TXmuo.png", "repo": "github.com:/jhugobb/pixel-it", "owner": "jhugobb", "intro": "Do you even pixel?\nBe full on pixels on your browser, with everything being 8-bit like!", "video": "", "active": true, "id": 22, "description": "This firefox extensions transforms _everyhting_ (yes, everything) into 8-bit mode. Font, images, theme, videos, this does it all! Get the retro feel on your browser with the click of a button. Invest in the pixels camp project that pixels it for you! __Do you even pixel?__", "name": "Pixel It", "created_at": "2017-09-29 10:03:44.551000", "wallet": "38a3e6fadd2d114fd327522fd4b6000d97dac678"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/17926881?v=4", "user": "sandromf", "name": "Sandro Micael Ferreira Monteiro"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/1164056?v=4", "user": "diogomp", "name": "Diogo Miguel Magalhães Pereira"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/10672875?v=4", "user": "bizrafaelsilva", "name": "Rafael Silva"}], "image": "https://i.imgur.com/HI41tRu.png", "repo": "", "owner": "sandromf", "intro": "Smart Cart -- Shopping assistant ", "video": "", "active": true, "id": 2, "description": "We want to offer one application to help any person on the daily shopping. Our project aim to show the people the information about the product they want to buy and alos provide more interesting inforamtion, like for example receipies to use the product and point other products to be used in the recepie.", "name": "SCART", "created_at": "2017-09-28 09:31:39.733000", "wallet": "81af9586adfb83bf1dd06ed04e7759bd3033c4a6"}, {"users": [{"avatar_url": "https://avatars2.githubusercontent.com/u/18689632?v=4", "user": "ines36", "name": "Inês Sampaio"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/16037370?v=4", "user": "ricardopereira33", "name": "Ricardo Pereira"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/4325027?v=3", "user": "fribmendes", "name": "Fernando Mendes"}, {"avatar_url": "https://avatars4.githubusercontent.com/u/1141870?v=4", "user": "pfac", "name": "Pedro Costa"}], "image": "https://i.imgur.com/nyUE0x3.png", "repo": "", "owner": "ines36", "intro": "You probably have already given and received Christmas presents. You probably have also joined that Secret Santa thing, giving presents to strangers. Our goal? Take Secret Santa to a whole new level.", "video": "", "active": true, "id": 42, "description": "#include <braga> is a volunteering movement that helps instituitions and individuals in need through technology.\n\nWe have in our city several instituitions that foster orphans and children without parent support, who can't afford Christmas presents. We want to invite everyone to help us reach them and give them a better Christmas.\n\nThrough a simple platform, we want to make a giant Secret Santa and invite everyone to give a Christmas present to an orphan child of our city. \n\nYou just need to register and wait for information about your match, to whom you will be bringing a smile to in December :)\n", "name": "Secret Santa by #include braga", "created_at": "2017-09-29 21:20:17.866000", "wallet": "f8aaee43f2f15852dbc31941bd50ebbb7ffdf245"}, {"users": [{"avatar_url": "https://avatars1.githubusercontent.com/u/4340039?v=4", "user": "royrijkers", "name": "Roy Rijkers"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/22718630?v=4", "user": "inespessoa", "name": "Inês Pessoa"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/19441097?v=3", "user": "obernardovieira", "name": "Bernardo Vieira"}], "image": "https://i.imgur.com/zx6Hbra.jpg", "repo": "https://github.com/royrijkers/wheretotravel", "owner": "royrijkers", "intro": "Service that suggests suitable travel destinations, based on user input", "video": "", "active": true, "id": 21, "description": "You know that feeling, searching for hours for a suitable destination to travel to?\n\nWe want to address this.\n\nApplications like Spotify proved that it is does not need to be hard to find want you want. We want to deliver a comparable experience.\n\nThis is how it works:\n\n- When using \"Travelized\" users can answer a few simple question.\n- Based on this information the system analyses automatically which destinations fit their needs.\n- The user is shown the result and can book a nice trip.\n\n", "name": "Travelized", "created_at": "2017-09-29 09:45:02.898000", "wallet": "1d7b8429f111769c14f85afdafc079ccbe11823f"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/477464?v=4", "user": "reaperfromhell", "name": "Pedro Luiz de Castro"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/3831461?v=4", "user": "tiago-rocha", "name": "Tiago Rocha"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/3257458?v=4", "user": "nikib", "name": "Veronika Berman"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/513444?v=3", "user": "smotko", "name": "Anže Pečar"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/20775063?v=4", "user": "diogor93", "name": "Diogo Filipe Fragueiro Rosa"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/3257458?v=4", "user": "nikib", "name": "Veronika Berman"}], "image": "https://i.imgur.com/0dodXPW.png", "repo": "", "owner": "NikiB", "intro": "Giving people parental control over the car for their children without invading the privacy of the youngsters", "video": "", "active": true, "id": 9, "description": "One of the scariest things for parents is when their kids start to drive. In one hand they want to give them freedom and the ability to gain experience on the road but on the other, parents want to keep the kids safe and within the limits that they set. Our app is exactly what can give the parents some piece of mind. They will be able to set a perimeter where the youngsters can drive without showing the exact location of the car st all times, thus not invading on privacy. Immobileze the car at hours that children should be at home. Setting the maximum speed limit, locking the car when need to be and controlling the amount of mileage per month.\nAs we're developing the app, the potential with this application is much greater. It can be a great solution for fleet and rental companies as a way to give their costumes rapid access to car2go since there is no more need for keys and the company can mobilize and unlock the car when the costumer gets near it. With future development of using inside microphone and camera to truly identify the person behind the wheel. ", "name": "DriverChap", "created_at": "2017-09-28 16:43:26.376000", "wallet": "1420f7e311d041c8172ea0a8ee16871e05187ec3"}, {"users": [{"avatar_url": "https://avatars3.githubusercontent.com/u/9970066?v=3", "user": "jpboliv", "name": "João Oliveira"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/416830?v=4", "user": "adbjesus", "name": "Alexandre Jesus"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/20225926?v=4", "user": "joaornmarques", "name": "João Marques"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/7316587?v=4", "user": "pedrocb", "name": "Pedro Belém"}], "image": "https://i.imgur.com/gRRM4Up.png", "repo": "", "owner": "jpboliv", "intro": "You know /r/place? We are PixelsPlace, find us at https://pixelsplace.xyz. We created a 400x200 canvas, and offer you some pixels to play with. All you got to do is use your imagination. Want to advertise your brand/project? Do it here. Maybe you just want to play a community game of tic-tac-toe. Go for it. Want to fight for your pixel-spot and show some dominance, your choice. Lets make some art!", "video": "", "active": true, "id": 25, "description": "# What we are doing\nWe're trying to create a masterpiece. We give you the big board and 15 pixels per minute, gather up and lets draw something unique and cool. It's a good place to just let your imagination fly.\n\n# To the Companies and Brands \nWe offer you a spot in our canvas, and a logo design so you can advertise your company, for the right ammount of EXP of course! Contact us through Slack at @jpboliv @joaornmarques @adbjesus @pedrocb.\n\n# To the PixelsCamp participants\nWe want to see what we are capable of creating all together, you can advertise your project here or you can just draw something stupid. ", "name": "PixelsPlace", "created_at": "2017-09-29 13:35:52.447000", "wallet": "a48f3b4c6ebc3bfacf533859349cb7d768a33641"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/667278?v=3", "user": "knokio", "name": "Diogo Figueiredo"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/3770860?v=3", "user": "numipinto", "name": "Nuno Pinto"}, {"avatar_url": "https://avatars1.githubusercontent.com/u/4998021?v=3", "user": "ajcamilo", "name": "André Camilo"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/26874645?v=4", "user": "trcdl", "name": "Tiago Oliveira Rodrigues"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/2471969?v=3", "user": "miroxo", "name": "Miguel Roxo"}, {"avatar_url": "https://avatars7.githubusercontent.com/u/6089439?v=4", "user": "nunopires", "name": "Nuno Pires"}], "image": "https://i.imgur.com/Vb5lUPj.jpg", "repo": "", "owner": "knokio", "intro": "Uma forma fácil de reportar problemas na cidade e ter um impacto positivo.", "video": "", "active": true, "id": 18, "description": "Todos os dias nos deparamos com problemas na nossa rua, no nosso bairro, na nossa cidade.\nEncontramos buracos na estrada, semáforos avariados, entre outras situações.\n\nHoje em dia não é fácil reportarmos essas situações.\nA tecnologia vai ajudar a que todos juntos melhorares as nossas cidades e vilas.\n\nCom o Poop City podemos facilmente identificar problemas no nosso dia-a-dia, registando com uma foto e uma pequena descrição.\n\nOs nossos \"vizinhos\" podem votar (com 💩) nas mais importantes.\nO campo de futebol público tem as balizas estragadas? Envia uma foto e descrição para a App, partilha no Facebook, angaria awareness!\n\nOs presidentes das camâras municipais, os vereadores, poderão ver facilmente o que se passa à volta deles e agir!\n\nParticipa já :)\n\n", "name": "Poop City", "created_at": "2017-09-28 22:07:15.597000", "wallet": "c28ae6b2eb879c467c163dd1f7257490caae093e"}, {"users": [{"avatar_url": "https://avatars0.githubusercontent.com/u/478962?v=3", "user": "cmota", "name": "Carlos Mota"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/5120207?v=3", "user": "danielgmarcos", "name": "Daniel Marcos"}, {"avatar_url": "https://avatars2.githubusercontent.com/u/8666141?v=4", "user": "telmojsneves", "name": "Telmo José Santos Neves"}, {"avatar_url": "https://avatars0.githubusercontent.com/u/2984462?v=4", "user": "bffcorreia", "name": "Bruno Correia"}, {"avatar_url": "https://avatars3.githubusercontent.com/u/14896863?v=4", "user": "diversos", "name": "André Almeida"}], "image": "https://i.imgur.com/vso1zJt.jpg", "repo": "", "owner": "cmota", "intro": "- I'm your assistant.\n\nAnd I can sing any song on your native language. 🎶", "video": "", "active": true, "id": 11, "description": "According to Telmo and the Internet (Wilhelm, Peter Emotions in everyday life, 2004) the human body is capable to perceive more than one hundred emotions every day* - and this on a good day:\n- 08h00: [anger] we wake up and feel that the all world is agains us \n- 08h01: [indignation] we blame ourselfs for being night owls\n- 08h05: [joy] we feel asleep \n- 09h00: [surprise] we wake and realise that we should have been ready 30 minutes ago\n- 09h15: [shame] we arrive at work late\n- ... \n\n*except Batman - he only feels one emotion: Justice.\n\n\nNow lets imagine, that you trust me, your friendly assistant, and give me access to your daily life metrics (you already do this  so don't think too much about it).\n\nI can understand what you're feeling at every moment and pick you the best song to cheer you up or to give that extra support that you need.", "name": "Oh Telmo achas? (Oh Telmo, do you really think that?)", "created_at": "2017-09-28 18:04:09.679000", "wallet": "c058051026be4e53e4341e24a6df49388c59311a"}]
